Tekla.Structures.Model.LoadTemperature
The Tekla.Structures.Model.LoadTemperature class defines a temperature change in a part, or a temperature difference between two part surfaces.
using System;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
LoadTemperature temperatureLoad = new LoadTemperature();
temperatureLoad.Position1 = new Point(0, 0, 0);
temperatureLoad.Position2 = new Point(1000, 0, 0);
temperatureLoad.BoundingBoxDx = 500;
temperatureLoad.BoundingBoxDy = 500;
temperatureLoad.BoundingBoxDz = 500;
temperatureLoad.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
temperatureLoad.PartFilter = "example";
temperatureLoad.TemperatureChangeForAxialElongation = 1.0;
temperatureLoad.TemperatureDifferentialSideToSide = 2.0;
temperatureLoad.TemperatureDifferentialTopToBottom = 3.0;
temperatureLoad.InitialAxialElongation = 4.0;
if (!temperatureLoad.Insert())
{
Console.WriteLine("Temperature load insert failed!");
}
}
}

Tekla.Structures.Model.LoadTemperature.#ctor
Initializes a new instance of the Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.Spanning
Property not supported in Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.PrimaryAxisDirection
Property not supported in Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.AutomaticPrimaryAxisWeight
Property not supported in Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.Weight
Property not supported in Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.LoadDispersionAngle
Property not supported in Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.CreateFixedSupportConditionsAutomatically
Property not supported in Tekla.Structures.Model.LoadTemperature class.

Tekla.Structures.Model.LoadTemperature.Position1
Gets or sets the first input position point.

Tekla.Structures.Model.LoadTemperature.Position2
Gets or sets the second input position point.

Tekla.Structures.Model.LoadTemperature.TemperatureChangeForAxialElongation
Gets or sets the temperature change for axial elongation.

Tekla.Structures.Model.LoadTemperature.TemperatureDifferentialTopToBottom
Gets or sets the temperature differential from top to bottom.

Tekla.Structures.Model.LoadTemperature.TemperatureDifferentialSideToSide
Gets or sets the temperature differential from side to side.

Tekla.Structures.Model.LoadTemperature.InitialAxialElongation
Gets or sets the initial axial elongation.

Tekla.Structures.Model.LoadTemperature.Insert
Inserts the load temperature into the model database.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.Select
Selects a load temperature from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.Modify
Modifies the existing load temperature in the model database to match the current one.
At the moment it is not possible to change the load attachment or the father.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.Delete
Deletes the load temperature instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.CreateInstance
Inserts the load temperature into the model database.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.SelectInstance
Selects the load temperature from the model database.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.ModifyInstance
Modifies the existing load temperature in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.LoadTemperature.ToStruct(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
Method for populating struct values from corresponding object.
commonAttributes: Reference to a struct which will be populated with common load attributes.
classAttributes: Reference to a struct which will be populated with class load attributes.

Tekla.Structures.Model.LoadTemperature.FromStruct(Tekla.Structures.ModelInternal.dotLoadCommonAttributes_t@,Tekla.Structures.ModelInternal.dotLoadClassAttributes_t@)
Method for getting object values from corresponding struct.
commonAttributes: Reference to struct which contains common load attributes.
classAttributes: Reference to struct which contains class load attributes.